initial_dev/vane_diffuser/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale   1;

#include "meshParameters"

vertices
(
    ( $xin  $yinl  -0.5)
    ($xout  $youtl -0.5)
    ($xout  $youtu -0.5)
    ( $xin  $yinu  -0.5)
    ( $xin  $yinl   0.5)
    ($xout  $youtl  0.5)
    ($xout  $youtu  0.5)
    ( $xin  $yinu   0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($hm $vm 1) 
    simpleGrading 
    (
    1 
    (
        (0.2 0.3 4)    // 20% y-dir, 30% cells, expansion = 4
        (0.6 0.4 1)    // 60% y-dir, 40% cells, expansion = 1
        (0.2 0.3 0.25) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
    ) 
    1
    )
);

edges
(
);

boundary
(
    inlet
    {
        type inlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type outlet;
        faces
        (
            (2 6 5 1)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }

    back
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
