initial_dev/vane_diffuser/system/meshParameters
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
xin   0;
yinl   -0.055;
yinu   0.055;
xout   0.22;
youtl   -0.148;
youtu   0.148;
hm   100;
vm   100;
